/*
[编程题] 牛牛与世界杯门票

时间限制：1秒

空间限制：32768K
今年的世界杯要开始啦，牛牛作为一个球迷，当然不会放过去开幕式现场的机会。但是牛牛一个人去又觉得太过寂寞，便想叫上了他的n个小伙伴陪他一起去莫斯科(一共n+1人)。当牛牛开始订开幕式的门票时，发现门票有m种套餐，每种套餐需要花费x元，包含y张门票，每张门票也可以单独购买，此时这张门票的价格为k元。请问牛牛要怎样选择购买门票，使得他花费的钱最少。(每种套餐可以购买次数没有限制)。

输入描述:

第一行输入三个数字n(0≤n≤999)、m(1≤m≤1000)和k(1≤k≤100000)
接下来m行，每行输入两个数字xi(1≤xi≤100000)和yi(2≤yi≤1000), 表示套餐的价格和套餐内包含的门票数量。



输出描述:

输出牛牛至少要花费的钱的数量。


输入例子1:

2 2 5
6 2
13 3


输出例子1:

11


*/

/*
现在差不多能看懂了，它定义一个一维数组，这还是一个一维背包问题
*/

#include<iostream>
using namespace std;
const int maxn = 1e3 + 5;   //表示人数
int dp[maxn];
int n,m,k,x,y;

int main()
{
    scanf("%d%d%d",&n,&m,&k);
    n++;
    for(int i=1; i<=n; i++)
        dp[i]=i*k;    //先随便构造初始解，一般从1开始的
    while(m--)
    {
        scanf("%d%d",&x,&y);
        for(int i=1; i<=n; i++)
        {
            if(i-y>=0)  //票不够
                dp[i]=min(dp[i],dp[i-y]+x);   //比较以前的值并更改
            else       //票够了
                dp[i]=min(dp[i],x);
        }
    }
    printf("%d\n",dp[n]);
    return 0;
}
